In [837]:
import pandas as pd

In [838]:

df = pd.DataFrame({
    "Name":[
        'Ghanshyam',
        'Manisha',
        'Shaunak',
        'Aadarsh',
        'Kaushal',
        'Santosh',
        'elina'
    ],
    "Age":[28, 26, 7, 27, 25, 35, 30],
    "Gender":['Male', 'Female', 'Male','male', 'male', 'Male', 'female']
},  index=([10, 20, 30, 7, 3, 4, 5]))

df.head()

         Name  Age  Gender
10  Ghanshyam   28    Male
20    Manisha   26  Female
30    Shaunak    7    Male
7     Aadarsh   27    male
3     Kaushal   25    male

In [839]:
age = pd.Series([28, 38, 48], name = "Age")
age

0    28
1    38
2    48
Name: Age, dtype: int64

In [840]:
df['Age']

10    28
20    26
30     7
7     27
3     25
4     35
5     30
Name: Age, dtype: int64

In [841]:
df['Age'].isna().sum()

0

In [842]:
# droplist = {'Age'}
# df.drop(droplist, axis=1, inplace = True)

In [843]:
# df.drop({"Name", 'Age'}, inplace=True, axis =1)

In [844]:
df

         Name  Age  Gender
10  Ghanshyam   28    Male
20    Manisha   26  Female
30    Shaunak    7    Male
7     Aadarsh   27    male
3     Kaushal   25    male
4     Santosh   35    Male
5       elina   30  female

In [845]:
df_titanic = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/main/doc/data/titanic.csv')
df_titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [846]:
df_titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [847]:
df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [848]:
df_titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [849]:
df_mean = df_titanic['Age'].mean()
df_titanic['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [850]:
df_titanic["Age"]= df_titanic['Age'].fillna(df_mean,  axis=0)
# df_titanic['Age'] = df_titanic['Age'].fillna(df_titanic['Age'].mean(), axis=0,)

In [851]:
df_titanic['Age'].isna().sum()

0

In [852]:
df_titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [853]:
df_titanic['Embarked'] = df_titanic['Embarked'].fillna(df_titanic['Embarked'].mode()[0])

In [854]:
df_titanic['Embarked'].isna().sum()

0

In [886]:
df_cabin = df_titanic['Cabin']

In [892]:
df_cabin = df_cabin.fillna(df_cabin.mode()[0])

In [893]:
df_cabin

0      B96 B98
1          C85
2      B96 B98
3         C123
4      B96 B98
        ...
886    B96 B98
887        B42
888    B96 B98
889       C148
890    B96 B98
Name: Cabin, Length: 891, dtype: object

In [857]:
df.to_numpy

<bound method DataFrame.to_numpy of          Name  Age  Gender
10  Ghanshyam   28    Male
20    Manisha   26  Female
30    Shaunak    7    Male
7     Aadarsh   27    male
3     Kaushal   25    male
4     Santosh   35    Male
5       elina   30  female>

In [894]:
df_titanic.index

RangeIndex(start=0, stop=891, step=1)

In [859]:
df

         Name  Age  Gender
10  Ghanshyam   28    Male
20    Manisha   26  Female
30    Shaunak    7    Male
7     Aadarsh   27    male
3     Kaushal   25    male
4     Santosh   35    Male
5       elina   30  female

In [860]:
df.T.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Name to Gender
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   10      3 non-null      object
 1   20      3 non-null      object
 2   30      3 non-null      object
 3   7       3 non-null      object
 4   3       3 non-null      object
 5   4       3 non-null      object
 6   5       3 non-null      object
dtypes: object(7)
memory usage: 300.0+ bytes

In [861]:
df.info(verbose = True)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 10 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 524.0+ bytes

### pandas dataframe - select_dtypes

In [862]:
df_titanic.select_dtypes\
    (include = 'int').isna().sum()

PassengerId    0
Survived       0
Pclass         0
SibSp          0
Parch          0
dtype: int64

In [863]:
df_titanic.select_dtypes\
    (exclude = 'int').isna().sum()

Name          0
Sex           0
Age           0
Ticket        0
Fare          0
Cabin       687
Embarked      0
dtype: int64

In [864]:
df_titanic.select_dtypes\
    (exclude = {'int', 'float'})

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [865]:
df_titanic.select_dtypes\
    (include = {'float', 'object'})

,Name,Sex,Age,Ticket,Fare,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,22.000000,A/5 21171,7.2500,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,PC 17599,71.2833,C85,C
2,"Heikkinen, Miss. Laina",female,26.000000,STON/O2. 3101282,7.9250,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,113803,53.1000,C123,S
4,"Allen, Mr. William Henry",male,35.000000,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,27.000000,211536,13.0000,NaN,S
887,"Graham, Miss. Margaret Edith",female,19.000000,112053,30.0000,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,W./C. 6607,23.4500,NaN,S
889,"Behr, Mr. Karl Howell",male,26.000000,111369,30.0000,C148,C
890,"Dooley, Mr. Patrick",male,32.000000,370376,7.7500,NaN,Q

In [866]:
df_titanic.select_dtypes\
    (include = 'float')

           Age     Fare
0    22.000000   7.2500
1    38.000000  71.2833
2    26.000000   7.9250
3    35.000000  53.1000
4    35.000000   8.0500
..         ...      ...
886  27.000000  13.0000
887  19.000000  30.0000
888  29.699118  23.4500
889  26.000000  30.0000
890  32.000000   7.7500

[891 rows x 2 columns]

In [867]:
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [868]:
df.to_numpy()

array([['Ghanshyam', 28, 'Male'],
       ['Manisha', 26, 'Female'],
       ['Shaunak', 7, 'Male'],
       ['Aadarsh', 27, 'male'],
       ['Kaushal', 25, 'male'],
       ['Santosh', 35, 'Male'],
       ['elina', 30, 'female']], dtype=object)

In [869]:
import numpy as np
df['Time'] = np.random.random(len(df))

In [870]:
df.values

array([['Ghanshyam', 28, 'Male', 0.1388939547877056],
       ['Manisha', 26, 'Female', 0.01151720680570556],
       ['Shaunak', 7, 'Male', 0.024343832413073807],
       ['Aadarsh', 27, 'male', 0.17470709200739998],
       ['Kaushal', 25, 'male', 0.22249221037605216],
       ['Santosh', 35, 'Male', 0.9388625165544742],
       ['elina', 30, 'female', 0.7631126970858046]], dtype=object)

In [871]:
df.style

In [872]:
df.style.format_index(str.upper, axis = 1)

In [873]:
df.axes

[Int64Index([10, 20, 30, 7, 3, 4, 5], dtype='int64'),
 Index(['Name', 'Age', 'Gender', 'Time'], dtype='object')]

In [874]:
df.ndim

2

In [875]:
df.size

28

In [876]:
df.shape

(7, 4)

In [877]:
df.memory_usage(index= True)

Index     356
Name       56
Age        56
Gender     56
Time       56
dtype: int64

In [878]:
df_titanic.empty

False

In [879]:
df_titanic.loc[100].at['Age']

28.0

In [880]:
df_titanic.loc[10:15].iloc[3]

PassengerId                             14
Survived                                 0
Pclass                                   3
Name           Andersson, Mr. Anders Johan
Sex                                   male
Age                                   39.0
SibSp                                    1
Parch                                    5
Ticket                              347082
Fare                                31.275
Cabin                                  NaN
Embarked                                 S
Name: 13, dtype: object

In [881]:
df.iloc[2:5]

       Name  Age Gender      Time
30  Shaunak    7   Male  0.024344
7   Aadarsh   27   male  0.174707
3   Kaushal   25   male  0.222492

In [882]:
df_titanic.iloc[lambda x:x.index % 2 == 1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
5,6,0,3,"Moran, Mr. James",male,29.699118,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.000000,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.000000,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
881,882,0,3,"Markun, Mr. Johann",male,33.000000,0,0,349257,7.8958,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.000000,0,0,C.A./SOTON 34068,10.5000,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.000000,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C

In [883]:
df_titanic.iloc[lambda x:x.index % 2 == 0]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,E46,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.000000,0,2,347742,11.1333,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.000000,0,0,7552,10.5167,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.000000,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,NaN,Q

In [884]:
df_titanic.iloc[1:5].iloc[3]

PassengerId                           5
Survived                              0
Pclass                                3
Name           Allen, Mr. William Henry
Sex                                male
Age                                35.0
SibSp                                 0
Parch                                 0
Ticket                           373450
Fare                               8.05
Cabin                               NaN
Embarked                              S
Name: 4, dtype: object